# Pandas

Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

Use for 
+ Preparetion
+ manipulation (rename columns ....
+ munging (data cleansing : organized in the right format)
+ Wrangling


Objective of pandas
+ understand about pandas
+ work with data structure
+ create dataFrame
+ Load data from file
+ Explore, select and filter
+ handle doubplicate data and missing values
+ group agregate, sort and rank the data

----------------------------
agregate = calculate

======================
What is time series of data? Cont
=> weather casting, stoc,

In [5]:
import pandas as pd

# Create series 
s1 = pd.Series(range(15))
s1

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int64

In [8]:
# Create series by list
list = [1,2,3,4,5,6,7,8,9,10]
s2 = pd.Series(list)
s2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [11]:
# Create series by NP Array
import numpy as np
arr = np.array([4,5,5,6,7,8])
s3 = pd.Series(arr)
s3

0    4
1    5
2    5
3    6
4    7
5    8
dtype: int32

In [28]:
# With specifies index
list = [10,20,30,40,50,60]
s4 = pd.Series(list, index = range(1,7))
s4[1:4]

2    20
3    30
4    40
dtype: int64

In [47]:
# With specifies index
dic = {'A':10,'B':20,'C':30,'D':40,'E':50,'F':60}
s4 = pd.Series(dic)
# type(dic)
# s4[1:5]
print(s4.values)
print(s4.index)
print(s4.shape)
# value
print(s4.loc['A']) 
print(s4.iloc[0]) 

# list
print(s4.loc[['A', 'C']])
print(s4.iloc[[0,2]])

# Slicing
print(s4.loc['A': 'E'])
print(s4.iloc[0:5])

[10 20 30 40 50 60]
Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')
(6,)
10
10
A    10
C    30
dtype: int64
A    10
C    30
dtype: int64
A    10
B    20
C    30
D    40
E    50
dtype: int64
A    10
B    20
C    30
D    40
E    50
dtype: int64

+ loc[] : Label based so we have to specified row & column 
    based on index row|column label
+ iloc[]: Interger position based, so we specified row & column by the integer 
    position value.

# Data Frame

In [61]:
df = pd.DataFrame(np.arange(1,26).reshape(5,5),
    columns= ['c1','c2','c3','c4','c5'],
    index = ['a','b','c','d','e'])
    # index = list('abcde') not work
df

   c1  c2  c3  c4  c5
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [74]:
print(df.loc['b'])
print('----------------------\n')
print(df.loc[['a','c']])
print('----------------------\n')
print(df.iloc[1])
print('----------------------\n')
print(df.iloc[[0,2]])
print('----------------------\n')
print(df.iloc[0:1,0:2])

c1     6
c2     7
c3     8
c4     9
c5    10
Name: b, dtype: int32
----------------------

   c1  c2  c3  c4  c5
a   1   2   3   4   5
c  11  12  13  14  15
----------------------

c1     6
c2     7
c3     8
c4     9
c5    10
Name: b, dtype: int32
----------------------

   c1  c2  c3  c4  c5
a   1   2   3   4   5
c  11  12  13  14  15
----------------------

   c1  c2
a   1   2

In [3]:
import pandas as pd
GDP = [21,16,5.7,4.3,3.1]
pop = [300,1420,140,80,1400]
data = {'GDP' : [21,16,5.7,4.3,3.1] , 'Population': [300,1420,140,80,1400]}
df=pd.DataFrame({'GDP' : [21,16,5.7,4.3,3.1] , 'Population_M': [300,1420,140,80,1400],
                  'Country':['USA','China','Japan','Germany','India']})
df

    GDP  Population_M  Country
0  21.0           300      USA
1  16.0          1420    China
2   5.7           140    Japan
3   4.3            80  Germany
4   3.1          1400    India

# iloc, loc

In [4]:
import pandas as pd
data = pd.DataFrame({
    'Brand' : ['Maruti', 'Hyundai', 'Tata',
               'Mahindra', 'Maruti', 'Hyundai',
               'Renault', 'Tata', 'Maruti'],
    'Year' : [2012, 2014, 2011, 
              2015, 2012, 2016, 2014, 
              2018, 2019],
    'Kms Driven' : [50000, 30000, 60000, 
                    25000, 10000, 46000,
                    31000,15000,12000],
    'City' : ['Guragaon','Delhi','Mumbai',
              'Delhi','Mumbai','Delhi',
              'Mumbai','Chennai','Ghaziabad'],
    'Mleage' : [28, 27 , 25 , 
                26, 28, 29 ,
                24 ,21 ,24]
})
display(data)

      Brand  Year  Kms Driven       City  Mleage
0    Maruti  2012       50000   Guragaon      28
1   Hyundai  2014       30000      Delhi      27
2      Tata  2011       60000     Mumbai      25
3  Mahindra  2015       25000      Delhi      26
4    Maruti  2012       10000     Mumbai      28
5   Hyundai  2016       46000      Delhi      29
6   Renault  2014       31000     Mumbai      24
7      Tata  2018       15000    Chennai      21
8    Maruti  2019       12000  Ghaziabad      24

In [27]:
# data.loc[0:1]
print(data.loc[0:2,'Brand':'Kms Driven'])
print('-----------------------------')
print(data.loc[:,'Brand':'Kms Driven'])
print('-----------------------------')
print(data.iloc[:,1:3])
print('-----------------------------')
print(data.iloc[7:9,3:5])

     Brand  Year  Kms Driven
0   Maruti  2012       50000
1  Hyundai  2014       30000
2     Tata  2011       60000
-----------------------------
      Brand  Year  Kms Driven
0    Maruti  2012       50000
1   Hyundai  2014       30000
2      Tata  2011       60000
3  Mahindra  2015       25000
4    Maruti  2012       10000
5   Hyundai  2016       46000
6   Renault  2014       31000
7      Tata  2018       15000
8    Maruti  2019       12000
-----------------------------
   Year  Kms Driven
0  2012       50000
1  2014       30000
2  2011       60000
3  2015       25000
4  2012       10000
5  2016       46000
6  2014       31000
7  2018       15000
8  2019       12000
-----------------------------
        City  Mleage
7    Chennai      21
8  Ghaziabad      24